[{"data":1,"prerenderedAt":-1},["Reactive",2],{"articles":3},[4,187],{"_path":5,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":9,"description":10,"date":11,"excerpt":12,"body":23,"_type":182,"_id":183,"_source":184,"_file":185,"_extension":186},"/articles/about-documentation","articles",false,"","About documentation","Documentation is an important part of software development, with a lot of opportunity for improvements and I recently discovered a workshop to solve my pain points","2023-09-19T00:00:00.000Z",{"type":13,"children":14},"root",[15],{"type":16,"tag":17,"props":18,"children":20},"element","h2",{"id":19},"about-documentation",[21],{"type":22,"value":9},"text",{"type":13,"children":24,"toc":173},[25,29,35,40,45,50,57,72,77,102,107,112,118,123,130,135,141,146,152,157,162,168],{"type":16,"tag":17,"props":26,"children":27},{"id":19},[28],{"type":22,"value":9},{"type":16,"tag":30,"props":31,"children":32},"p",{},[33],{"type":22,"value":34},"I have never been keen on the documentation practice. This article is the retrospective of my own experience and different scenario I met.",{"type":16,"tag":30,"props":36,"children":37},{},[38],{"type":22,"value":39},"Over the years, I learned documentation is hardly maintained, often forgotten, never targets the right audience. The process review, and fool proofing is often light. We often find a dedicated author and a lack of shared ownership among a team. When the author leaves, a handover may be done, yet again often a light process. Documentation may be reviewed upon completion, it does not follow the same care as the code it reflects. In the recent years, we found an increase toward documentation as code tools (Structurizr, OpenAPI specifications). These greatly helps in having different views over the code. The closer the documentation is to the code, the more consistent it stays. On the other hand, documentation manually written in a Notion, rarely survive the passage of time. Architecture diagrams often fall short over the iterations, refactoring and evolutions.",{"type":16,"tag":30,"props":41,"children":42},{},[43],{"type":22,"value":44},"When discussing with peers, I often draw my mental model of a high level architecture diagram on the fly, specifically for the context we are in, ignoring existing diagrams, which serve a different purpose, yet represent the same components. It's probably a problem of documentation structure and search. A lot of waste is generated this way, ephemeral diagram for the purpose of sharing knowledge with a group of person as a support for an initiative. Even though we invest a lot of time in documentation, review and maintenance, we fail to reuse this documentation for another purpose than knowledge.",{"type":16,"tag":30,"props":46,"children":47},{},[48],{"type":22,"value":49},"This is where the following practice helped me to change my understanding about documentation.",{"type":16,"tag":51,"props":52,"children":54},"h3",{"id":53},"bytesize-architecture-sessions",[55],{"type":22,"value":56},"Bytesize Architecture Sessions",{"type":16,"tag":30,"props":58,"children":59},{},[60,62,70],{"type":22,"value":61},"I discovered at a virtual-ddd meetup the framework ",{"type":16,"tag":63,"props":64,"children":68},"a",{"href":65,"rel":66},"https://bytesizearchitecturesessions.com/",[67],"nofollow",[69],{"type":22,"value":56},{"type":22,"value":71}," from Andrea Magnorsky. It's a workshop framework to share the same understanding of a system among the participant. Bonus, you get a great documentation at the end of a fun session. From there on, I will consider you checked out the website and are familiar with the framework.",{"type":16,"tag":30,"props":73,"children":74},{},[75],{"type":22,"value":76},"The \"Alone together\" part is the key part to me of the session. People naturally focus on what they believe is important from their point of view. With diverse people, it gives a rich output of the session. Some may be traumatized by a previous incident, or an underestimated edge case or a detail only them are aware of. Some other may not have enough confidence to share, underestimating their knowledge, ability or fearing the exposure (\"wait, you're the senior and you don't know?!\"). At first, people would be surprised by their unfinished work. I try to warn ahead to not focus on doing something perfect since we'll redraw later in the consensus. I found interesting to push people who even don't know the system to exercise:",{"type":16,"tag":78,"props":79,"children":80},"ul",{},[81,87,92,97],{"type":16,"tag":82,"props":83,"children":84},"li",{},[85],{"type":22,"value":86},"it makes them think about the problem, and adopt it",{"type":16,"tag":82,"props":88,"children":89},{},[90],{"type":22,"value":91},"they may challenge the solution with out-of-the-box thinking",{"type":16,"tag":82,"props":93,"children":94},{},[95],{"type":22,"value":96},"make mistakes and learn edge cases",{"type":16,"tag":82,"props":98,"children":99},{},[100],{"type":22,"value":101},"...",{"type":16,"tag":30,"props":103,"children":104},{},[105],{"type":22,"value":106},"The consensus part is the second most important to me. So much happens in this part. Questions are raised, curiosity is answered, we can even review the design altogether. \"This should not be this way. Why not like this?\", \"What happens when ...?\", \"Are we still doing it like this?!\", \"Oh this is deprecated and we forgot to clean?\", etc.",{"type":16,"tag":30,"props":108,"children":109},{},[110],{"type":22,"value":111},"When using a live system as goal, it's great to share understanding of the system. When setting the goal for a change, we design and document first the solution, then head for implementation, easily going back and forth between both. We reach a living documentation.",{"type":16,"tag":51,"props":113,"children":115},{"id":114},"applications",[116],{"type":22,"value":117},"Applications",{"type":16,"tag":30,"props":119,"children":120},{},[121],{"type":22,"value":122},"With the team I'm part of, we practiced it several times. We also applied in two other situations: in discussion with peers, as well as cross team alignment for integration contracts.",{"type":16,"tag":124,"props":125,"children":127},"h4",{"id":126},"a-team-ceremony",[128],{"type":22,"value":129},"A team ceremony",{"type":16,"tag":30,"props":131,"children":132},{},[133],{"type":22,"value":134},"This is where it makes more sense as the iterative approach helps to continuously build the documentation until nothing is left to draw. The past quarter, the team and I were constrained to work two features in parallel. I'll keep for a later post why it was a difficult experience. Yet, the Bytesize Architecture Session helped us to bridge the gap between the members about what has been done on each side. We did it after the implementation was done. People adopted both contexts. The design and implementation were reviewed. Finally, a documentation was agreed upon.",{"type":16,"tag":124,"props":136,"children":138},{"id":137},"with-a-peer",[139],{"type":22,"value":140},"With a peer",{"type":16,"tag":30,"props":142,"children":143},{},[144],{"type":22,"value":145},"I discovered a new framework and I wanted to share it with many more people. I was having a session with someone with a different experience on the system. We both had one bit of an undocumented legacy process, I proposed to spend some time alone to draw our knowledge and then we searched for consensus, noting down questions, uncharted areas and connecting dots.",{"type":16,"tag":124,"props":147,"children":149},{"id":148},"cross-team-interactions",[150],{"type":22,"value":151},"Cross team interactions",{"type":16,"tag":30,"props":153,"children":154},{},[155],{"type":22,"value":156},"When dealing with reorganization, scopes change, knowledge is transferred and usually this is time for a load of Notion page transferred from one team to the other. The knowing team will expect questions for a few months, until the team taking over will be comfortable with the system.",{"type":16,"tag":30,"props":158,"children":159},{},[160],{"type":22,"value":161},"Applying the Bytesize Architecture Session helped in adopting the problem, collaborate to the documentation, practice the implementation as we had to look up the code. Instead of spending few hours in presentations, with one way discussions, rare questions, overflow of information, we actually spent fun times to draw together and sharing why we did things in a different manner, which incident happened and where.",{"type":16,"tag":17,"props":163,"children":165},{"id":164},"conclusion",[166],{"type":22,"value":167},"Conclusion",{"type":16,"tag":30,"props":169,"children":170},{},[171],{"type":22,"value":172},"Documentation is finally something fun to do, with a collaborative approach like the Bytesize Architecture Session. The output of each session are always carefully crafted, and great outcome for the team with this shared understanding of the system.",{"title":8,"searchDepth":174,"depth":174,"links":175},2,[176,181],{"id":19,"depth":174,"text":9,"children":177},[178,180],{"id":53,"depth":179,"text":56},3,{"id":114,"depth":179,"text":117},{"id":164,"depth":174,"text":167},"markdown","content:articles:2.about-documentation.md","content","articles/2.about-documentation.md","md",{"_path":188,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":189,"description":190,"date":191,"body":192,"_type":182,"_id":273,"_source":184,"_file":274,"_extension":186},"/articles/writing","Finally, a blog.","This article explains where this idea comes from and what I envision for its content.","2023-09-06T00:00:00.000Z",{"type":13,"children":193,"toc":270},[194,200,205,210,229,234,257],{"type":16,"tag":17,"props":195,"children":197},{"id":196},"first-article-but-why",[198],{"type":22,"value":199},"First article but why",{"type":16,"tag":30,"props":201,"children":202},{},[203],{"type":22,"value":204},"A year ago, two friends told me to start writing. At first, it took me by surprise. Where does that come from? I sometimes wondered about having a blog, to start increasing my online presence. Yet, smarter people around me were already sharing good stuffs. Everything is already shared.",{"type":16,"tag":30,"props":206,"children":207},{},[208],{"type":22,"value":209},"After a few months, they came back with a more explicit proposal: \"start writing down your own heuristics!\". From this discussion, following thoughts came up:",{"type":16,"tag":211,"props":212,"children":213},"ol",{},[214,219,224],{"type":16,"tag":82,"props":215,"children":216},{},[217],{"type":22,"value":218},"I don't have any heuristics.",{"type":16,"tag":82,"props":220,"children":221},{},[222],{"type":22,"value":223},"I never take the time to materialize them.",{"type":16,"tag":82,"props":225,"children":226},{},[227],{"type":22,"value":228},"I'm in the field since 10 years, I should have some.",{"type":16,"tag":30,"props":230,"children":231},{},[232],{"type":22,"value":233},"First, for my own benefits, since I memorize much more by practicing. Second, it might be useful to some other folks out there. Will I only talk about tech? Not sure. Since it's for me a knowledge center, I guess I'd also share on various theme I'd be into.",{"type":16,"tag":30,"props":235,"children":236},{},[237,239,246,248,255],{"type":22,"value":238},"On January 2nd 2023, I attended this ",{"type":16,"tag":63,"props":240,"children":243},{"href":241,"rel":242},"https://virtualddd.com/sessions/85",[67],[244],{"type":22,"value":245},"open space",{"type":22,"value":247}," organized by virtual-ddd. If you ever have the chance to attend any of them, I strongly recommend it. Among the different sessions I attended, one particularly led by ",{"type":16,"tag":63,"props":249,"children":252},{"href":250,"rel":251},"https://mastodon.social/@diana@hachyderm.io",[67],[253],{"type":22,"value":254},"Diana Montalion",{"type":22,"value":256}," inspired me to start writing with a pen on a notebook. Many participants shared their point of view on writing, maintaining a blog, or even simply on paper. This convinced me to invest time in this practice. I now take my notebook from time to time when I feel my brain actively thinking about too many things at once.",{"type":16,"tag":30,"props":258,"children":259},{},[260,262,268],{"type":22,"value":261},"If ever you want to react to an article, I would happily discuss on social networks about it or through the ",{"type":16,"tag":63,"props":263,"children":265},{"href":264},"/contact",[266],{"type":22,"value":267},"contact",{"type":22,"value":269}," form. I don't think this blog would ever have a comment section.",{"title":8,"searchDepth":174,"depth":174,"links":271},[272],{"id":196,"depth":174,"text":199},"content:articles:1.writing.md","articles/1.writing.md"]